Repository: ComNets-Bremen/easyCCS
Catalog: ccs-client/src/i18n/messages.*.xlf
Languages: de

source: User settings
de: Benutzereinstellungen

source: Admin settings
de: Admin Einstellungen

source: Manage Content
de: Content verwalten

source: Manage Skills
de: Skills verwalten

source: Manage Modules
de: Module verwalten

source: Complete Graph
de: Vollständiger Graph

source: Selectable Skill Graph
de: Konfigurierbarer Skillgraph

source: Get Skill Dependencies
de: Skillabhängigkeiten anzeigen

source: Imprint
de: Impressum

source: Privacy
de: Datenschutz

source: Visualization of Content Modules
de: Visualisierung der Content Module

source: This graph shows the connection between the content blocks by the different skills.
de: Dieser Graph stellt die Verbindung zwischen den einzelnen Inhalten durch die unterschiedlichen Skills dar.

source: Send us a message
de: Senden Sie uns eine Nachricht

source: Content Title
de: Content Titel

source: Workload
de: Arbeitszeit

source: Action
de: Aktion

source: No data matching the filter "{{ input.value }}"
de: Es wurden keine passenden Daten zur Filterauswahl gefunden "{{ input.value }}"

source: Delete Content?
de: Content löschen?

# AreYouSure
source: Are your sure to delete selected data?
de: Sind Sie sicher, dass sie die ausgewählten Daten löschen möchten?

source: Cancel
de: Abbrechen

source: Delete
de: Löschen

# Saved
source: Data saved successfully
de: Daten erfolgreich gelöscht

source: Accept
de: Akzeptieren

source: Decline
de: Ablehnen

source: Edit content
de: Content bearbeiten

source: Enter name
de: Name eingeben

source: Name must not be empty
de: Name darf nicht leer sein

source: Enter valid email address
de: Geben Sie eine gültige Email Adresse ein

source: Email must not be empty and be a valid address
de: Email darf nicht leer sein und muss eine gültige Adresse sein

source: Subject
de: Betreff

source: Enter message subject
de: Betreff eingeben

source: Subject must not be empty
de: Betreff darf nicht leer sein

source: Your message
de: Ihre Nachricht

source: Message
de: Nachricht

source: Enter message
de: Nachricht eingeben

source: Message must not be empty
de: nachricht darf nicht leer sein

source: Send
de: Senden

# ContactMsgSent
source: Your message has been sent successfully
de: nachricht wurde erfolgreich verschickt

source: Description
de: Beschreibung

source: Enter description
de: Beschreibung eingeben

source: Description must not be empty
de: Beschreibung darf nicht leer sein

source: Required skills
de: Benötigte Skills

source: Add skill...
de: Skill hinzufügen...

source: New skills
de: Neue Skills

source: Add Wikidata Object...
de: Wikidata Object hinzufügen...

source: Content workload
de: Content Bearbeitungsszeit

source: Workload
de: Bearbeitungsszeit

source: Minutes
de: Minuten

source: Binary Content
de: Dateien

source: Click to collapse
de: Klicken um auszublenden

source: URL Content
de: URL Inhalte

source: Add url
de: Url hinzufügen

source: Save
de: Speichern

source: Back to list
de: Zurück zur Liste

# InvalidContentId
source: Invalid id - can't find content to edit!
de: Ungültige Id - kein Content zum Bearbeiten gefunen!

# ContactMsgSentFailed
source: Your message could not be sent
de: Ihre Nachricht konnte nicht gesendet werden

# SkillAlreadyExist
source: Skill does already exist
de: Skill existiert bereits

# WikidataObjAlreadyExist
source: Wikidata Object does already exist
de: Wikidata Object existiert bereits

# UrlAlreadyExist
source: Url has already been added
de: Url hinzugefügt

source: Edit module
de: Modul bearbeiten

source: Module content modules
de: Modul Content Module

source: Add content...
de: Content hinzufügen...

# InvalidModuleId
source: Invalid id - can't find module to edit!
de: Ungültige Id - Modul zum Bearbeiten nicht gefunden!

# ContentAlreadyExist
source: Content does already exist
de: Content existiert bereits

source: Edit skill
de: Skill bearbeiten

# InvalidSkillId
source: Invalid id - can't find skill to edit!
de: Ungültige Id - Skill zum Bearbeiten nicht gefunden!

source: Legal Notice
de: Impressum

source: Address:
de: Anschrift:

source: Telephone
de: Telefon

source: Legal Form
de: Rechtsform

source: The University of Bremen is a corporation under public law, officially represented by its President Prof. Dr.-Ing. Bernd Scholz-Reiter.<br /> The responsible supervisory authority is Bremen’s Senator for Science and Ports, Katharinenstraße 37, 28195 Bremen.
de: Die Universität Bremen ist eine Körperschaft des Öffentlichen Rechts. Sie wird durch den Rektor Prof. Dr.-Ing. Bernd Scholz-Reiter gesetzlich vertreten.<br /> Zuständige Aufsichtsbehörde ist die Senatorin für Wissenschaft und Häfen, Katharinenstraße 37, 28195 Bremen.

source: German VAT ID
de: Umsatzsteuer-Identifikationsnummer

source: DE 811 245 070 (pursuant § 27 a UStG)
de: DE 811 245 070 (gemäß § 27 a UStG)

source: Press and Communcations OfficeUniversität Bremen
de: Referat Hochschulkommunikation und -marketing der Universität Bremen

source: Data Privacy
de: Datenschutz

source: <a href="https://www.uni-bremen.de/en/data-privacy" target="_blank"> Notes on data privacy </a>
de: <a href="https://www.uni-bremen.de/datenschutzerklaerung" target="_blank"> Hinweise zum Datenschutz </a>

source: Disclaimer
de: Haftungsausschluss

source: <a href="https://www.uni-bremen.de/en/data-privacy/university-of-bremen-data-processing-policy" target="_blank" > Notes on disclaimer </a>
de: <a href="https://www.uni-bremen.de/datenschutzerklaerung/haftungsausschluss" target="_blank" > Hinweise zum Haftungsausschluss </a>

source: University of Bremen Data Processing Policy
de: Benutzungsordnung

source: <a href="https://www.uni-bremen.de/en/data-privacy/regulation" target="_blank" >Notes on University of Bremen Data Processing Policy </a>
de: <a href="https://www.uni-bremen.de/datenschutzerklaerung/benutzungsordnung" target="_blank" >Hinweise zur Benutzungsordnung </a>

source: Module Title
de: Modul Titel

source: Delete module?
de: Modul löschen?

source: Login successfull
de: Login erfolgreich

source: Login failed
de: Login fehlgeschlagen

source: Logout successfull
de: Logout erfolgreich

source: Skill overview
de: Skill Übersicht

source: Skill detail view
de: Skill Details

source: Skill description: {{ skill.description }}
de: Skill Beschreibung: {{ skill.description }}

source: Back
de: Zurück

# InvalidSkillIdDetail
source: Invalid id - can't find skill!
de: Ungültige Id - Skill nicht gefunden!

source: Resulting graph for target skills
de: Graph für ausgwählte Skills

source: Content Title
de: Content Titel

source: Required Skills
de: Benötigte Skills

source: New Skills
de: Neue Skills

source: No data found
de: Keine Daten gefunden

source: Skill marked as known by user
de: Vom Benutzer als bekannt markierter Skill

source: Skill found by algorithm
de: Per Algorithmus gefundener Skill

source: <mat-icon class="alarm-icon">report</mat-icon> No content found for the given skill
de: <mat-icon class="alarm-icon">report</mat-icon> Kein Conten gefunden für ausgewählte Skills

source: Critical skills found
de: Kritische Skills gefunden

source: Total workload: {{ totalWorkload }} minutes
de: Komplette Bearbeitungsszeit: {{ totalWorkload }} Minuten

source: Select skills
de: Skills auswählen

source: Title
de: Titel

source: Show Result
de: Ergebnis anzeigen

source: Load Graph
de: Graph laden

source: Select title to load graph configuration
de: Name auswählen um Graph Konfiguration zu laden

source: Load
de: Laden

source: Skill Title
de: Skill Titel

source: Delete Skill?
de: Skill löschen?

source: Creating new lectures and aligning the contents to the students and their knowledge can be a challenging work for all levels of education: Knowledge dependencies between the different blocks of lectures are not always visible. The problem increases if content from third parties like colleagues or from the Internet is being used. The content curation tool described in this poster aims on this challenge and offers a way of automatic, skill-based lecture creation and dependency management. The objective is that the lecturer can enter the required skills as well as the type of teaching materials and the system will generate a complete course from available contents.
de: Neue Vorlesungen zu erstellen und dabei die Inhalte auf das Wissen der Studenten auszurichten kann eine große Herausforderung sein: Wissensabhängigkeiten zwischen einzelnen Abschnitten der Vorlesung sind nicht immer sofort sichtbar. Diese Problematik wird zusätzlich verstärkt, wenn Inhalte von Dritten, z.B. von Kollegen oder aus dem Internet verwendet werden. Das Content Curation Tool welches in diesem Poster vorgestellt wird, beschreibt diese Herausforderung und zeigt einen Weg auf, der automatisierte, skillbasierende Vorlesungserstellung sowie das Management von Abhängigkeiten erlaubt. Die Zielsetzung ist es, dass ein Vortragender benötigte Skills und verschiedene Vorlesungsmaterialien vorgibt und das System daraus einen kompletten Kurs aus den vorhandenen Inhalten generiert.

source: <i>easyCCS</i> - the easy content curation system aims on this challenge and allows an easy management of lecturing content. Stay tuned for additional information!
de: <i>easyCCS</i> - das Easy Content Curation System zielt genau auf diese Herausforderung ab und ermöglicht ein einfaches Vorlesungsinhalts-Management. Weitere Informationen folgen!

source: This work is presented as a poster on the <a href="https://sigcse2021.sigcse.org/" target="_blank" >52nd ACM Technical Symposium on Computer Science Education (SIGCSE)</a >. The abstract can be found here: <a href="https://dl.acm.org/doi/10.1145/3408877.3439601" target="_blank" >Automatic Content Curation for Online Learning Materials</a >.
de: Diese Arbeit wurde als Poster vorgestellt unter <a href="https://sigcse2021.sigcse.org/" target="_blank" >52nd ACM Technical Symposium on Computer Science Education (SIGCSE)</a >. Der Abstract kann hier gefunden werden: <a href="https://dl.acm.org/doi/10.1145/3408877.3439601" target="_blank" >Automatic Content Curation for Online Learning Materials</a >.
